Конфигурация/Reports/ОборотноСальдоваяВедомостьПоСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ОборотноСальдоваяВедомостьПоСчету</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСубсчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазвернутоеСальдо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйРегистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скПоЛицевомуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Reports/ОборотноСальдоваяВедомостьПоСчету/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РаботаСБухгалтерскимиОтчетами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ВариантОтчета");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	Форма			= Новый Структура;
	ИмяОтчета		= ЭтотОбъект.Метаданные().Имя;	
	МенеджерОтчета	= Отчеты[ИмяОтчета];
	
	Форма.Вставить("НаборПоказателей", МенеджерОтчета.ПолучитьНаборПоказателей());
	Форма.Вставить("Результат", Новый ТабличныйДокумент);
	Форма.Вставить("ВыводитьПодвал", Ложь);
	Форма.Вставить("ВыводитьЗаголовок", Ложь);
	Форма.Вставить("ВыводитьЕдиницуИзмерения", Ложь);
	Форма.Вставить("МакетОформления", "");
	Форма.Вставить("ДанныеРасшифровки", Новый ДанныеРасшифровкиКомпоновкиДанных);	
	Форма.Вставить("Отчет", ЭтотОбъект);
	Форма.Вставить("ИмяФормы", "Отчет." + ИмяОтчета + ".ФормаОтчета");
	
	// ПриЗагрузкеПользовательскихНастроекНаСервере
	
	Если НастройкиОтчета.Свойство("ВариантОтчета") И ТипЗнч(НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(НастройкиОтчета.ВариантОтчета);
		Настройки = ВариантОтчета.Настройки.Получить();
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетами.ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, Настройки);
	
	Если Настройки <> Неопределено Тогда 
		СтруктураДанныхКонтактногоЛица = Неопределено;
		
		Настройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		Настройки.ДополнительныеСвойства.Свойство("ВыводитьПодвал", Форма.ВыводитьПодвал);
		
		Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
			ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
		КонецЕсли;
	КонецЕсли;
	
	// АвтоматическоеФормирование
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.НачалоПериода = НастройкиОтчета.Период.ДатаНачала; 
	ЭтотОбъект.КонецПериода = НастройкиОтчета.Период.ДатаОкончания; 
	
	Если НастройкиОтчета.Свойство("Подписант") Тогда 
		ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	КонецЕсли;
	
	// АвтоматическоеФормированиеНаСервере
	
	ДополнительныеСвойства = ЭтотОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", 	Форма.ВыводитьЗаголовок);
	ДополнительныеСвойства.Вставить("ВыводитьПодвал", 		Форма.ВыводитьПодвал);

	ПараметрыОтчета		= ПодготовитьПараметрыОтчета(Форма);
	РезультатВыполнения	= РаботаСБухгалтерскимиОтчетами.СформироватьОтчет(ПараметрыОтчета);
	
	// Заполняем настройки печати	
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(РезультатВыполнения.Результат, ЭтотОбъект.Метаданные().ПолноеИмя());
	
	// Фиксируем результат
	
	НастройкиОтчета.Вставить("Результат", РезультатВыполнения.Результат);
	
КонецПроцедуры

Функция ПодготовитьПараметрыОтчета(Форма) Экспорт
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Организация"                      , ЭтотОбъект.Организация);
	ПараметрыОтчета.Вставить("НачалоПериода"                    , ЭтотОбъект.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода"                     , ЭтотОбъект.КонецПериода);
	ПараметрыОтчета.Вставить("СчетДоверительногоУправления"     , ЭтотОбъект.СчетДоверительногоУправления);
	ПараметрыОтчета.Вставить("ПоказательБУ"                     , ЭтотОбъект.ПоказательБУ);
	ПараметрыОтчета.Вставить("ПоказательВалютнаяСумма"          , ЭтотОбъект.ПоказательВалютнаяСумма);
	ПараметрыОтчета.Вставить("ПоказательКоличество"             , ЭтотОбъект.ПоказательКоличество);
	ПараметрыОтчета.Вставить("РазвернутоеСальдо"                , ЭтотОбъект.РазвернутоеСальдо);
	ПараметрыОтчета.Вставить("РазмещениеДополнительныхПолей"    , ЭтотОбъект.РазмещениеДополнительныхПолей);
	ПараметрыОтчета.Вставить("Периодичность"                    , ЭтотОбъект.Периодичность);
	ПараметрыОтчета.Вставить("Счет"                             , ЭтотОбъект.Счет);
	ПараметрыОтчета.Вставить("ПоСубсчетам"                      , ЭтотОбъект.ПоСубсчетам);
	ПараметрыОтчета.Вставить("Группировка"                      , ЭтотОбъект.Группировка.Выгрузить());
	ПараметрыОтчета.Вставить("ДополнительныеПоля"               , ЭтотОбъект.ДополнительныеПоля.Выгрузить());
	ПараметрыОтчета.Вставить("РежимРасшифровки"                 , ЭтотОбъект.РежимРасшифровки);
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"                , Форма.ВыводитьЗаголовок);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"                   , Форма.ВыводитьПодвал);
	ПараметрыОтчета.Вставить("ДанныеРасшифровки"                , Форма.ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("МакетОформления"                  , Форма.МакетОформления);
	Если ТипЗнч(Форма) = Тип("Структура") Тогда 				// вызов из автоматического формирования, переход по расшифровкам не предполагается
	    ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"        , ЭтотОбъект.СхемаКомпоновкиДанных);
	Иначе														// интерактивный вызов - нужно брать правильную, измененную схему чтобы расшифровки работали правильно
	    ПараметрыОтчета.Вставить("СхемаКомпоновкиДанных"        , ПолучитьИзВременногоХранилища(Форма.СхемаКомпоновкиДанных));
	КонецЕсли;
	ПараметрыОтчета.Вставить("ИдентификаторОтчета"              , РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьИдентификаторОбъекта(Форма));
	ПараметрыОтчета.Вставить("НастройкиКомпоновкиДанных"        , ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрыОтчета.Вставить("НаборПоказателей"                 , Отчеты[ПараметрыОтчета.ИдентификаторОтчета].ПолучитьНаборПоказателей());
	ПараметрыОтчета.Вставить("ВыводитьЕдиницуИзмерения"         , Форма.ВыводитьЕдиницуИзмерения);
	ПараметрыОтчета.Вставить("УчетныйРегистр"                   , ЭтотОбъект.УчетныйРегистр);
	ПараметрыОтчета.Вставить("скПоЛицевомуСчету"                , ЭтотОбъект.скПоЛицевомуСчету);
	
	СтруктураДанныхКонтактногоЛица = Неопределено; 
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	ПараметрыОтчета.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

#КонецЕсли
